Рабочая.Задачи2/src/InformationRegisters/ЦБР_УточненияПоЗадачамЗаданиям/ЦБР_УточненияПоЗадачамЗаданиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_УточненияПоЗадачамЗаданиям</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстОтвета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтветаНаЗапросФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОтветаНаЗапрос</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДатаОтветаНаЗапрос</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_ДействияПоЗаданиям/ЦБР_ДействияПоЗаданиям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_ДействияПоЗаданиям</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ЦБР_Состояние</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DocumentRef.ЦБР_Задание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончаниеДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаписьКалендаря</name>
    <type>
      <types>CatalogRef.ЦБР_ЗаписиРабочегоКалендаря</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_СтатусыЗадач/ЦБР_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦБР_СтатусыЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СостояниеЗадачи</name>
    <type>
      <types>EnumRef.ЦБР_Состояние</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЦБР_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Рабочая.Задачи2/src/Enums/ЦБР_Состояние/ЦБР_Состояние.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦБР_Состояние</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ГотовКСдаче</name>
  </enumValues>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИнформации</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>НаТестировании</name>
  </enumValues>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ПринятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>Приостановлен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>УточнениеТребований</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

Рабочая.Задачи2/src/InformationRegisters/ЦБР_УточненияПоЗадачамЗаданиям/Forms/ФормаУточнения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Задание", 	Задание);
	Параметры.Свойство("Заявитель", Заявитель);
	Параметры.Свойство("Ответчик", 	Ответчик);	
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если СокрЛП(ТекстЗапроса) = "" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указан текст запроса.");
		Возврат;
	КонецЕсли;
	Отправлено = СохранитьНаСервере();  
	Если Отправлено Тогда
		СообщениеВОбсуждение();
		ЭтаФорма.Закрыть(Истина);  
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьНаСервере()    
	
	ВТранзакции = ПроверитьНеобходимостьТранзакции();
	
	Если ВТранзакции Тогда //Если нужно что-то менять в объектах - делаем все в транзакции 
		НачатьТранзакцию();
	КонецЕсли;
	
	Запись = РегистрыСведений.ЦБР_УточненияПоЗадачамЗаданиям.СоздатьМенеджерЗаписи(); 
	Запись.Период 		= ТекущаяДатаСеанса();	
	Запись.Задание 		= Задание;
	Запись.Заявитель 	= Заявитель;
	Запись.Ответчик 	= Ответчик;
	Запись.ТекстЗапроса = ТекстЗапроса;
	Запись.Записать();
	
	Если ВТранзакции Тогда   
		
		ЗаданиеОбъект = Задание.ПолучитьОбъект(); 
		
		Если ТипЗнч(Задание) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
			ПоследнееДействие = ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПоследнееДействие(Задание);
			Если ПоследнееДействие <> Неопределено Тогда
				Если Не ЗначениеЗаполнено(ПоследнееДействие.ДатаОкончаниеДействия) Тогда
					
					МенеджерЗаписи = РегистрыСведений.ЦБР_ДействияПоЗаданиям.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьПоследнееДействие(
					Задание));
					МенеджерЗаписи.Прочитать();
					МенеджерЗаписи.ДатаОкончаниеДействия = ТекущаяДатаСеанса();
					МенеджерЗаписи.Статус                = Перечисления.ЦБР_Состояние.Приостановлен;
					МенеджерЗаписи.Комментарий           = "Уточнение информации";
					
					Действие = МенеджерЗаписи.ЗаписьКалендаря.ПолучитьОбъект();
					Действие.ДатаОкончания = ТекущаяДатаСеанса();
					Действие.Записать();
					
					РаботаСРабочимКалендаремСервер.УстановитьОтработанаЗаписьКалендаря(Действие.Ссылка);
					
					СтатусЗадачи = Перечисления.ЦБР_Состояние.ЗапросИнформации;
					
					СтруктураДат = Новый Структура;
					СтруктураДат.Вставить("ДатаНачала", НачалоДня(МенеджерЗаписи.ДатаНачалаДействия));
					СтруктураДат.Вставить("ДатаОкончания", НачалоДня(МенеджерЗаписи.ДатаОкончаниеДействия));
					СтруктураДат.Вставить("ВремяНачала", ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьВремя(
					МенеджерЗаписи.ДатаНачалаДействия));
					СтруктураДат.Вставить("ВремяОкончания", ЦБР_ЗадачиЗаданияВызовСервера.ПолучитьВремя(
					МенеджерЗаписи.ДатаОкончаниеДействия));
					ЦБР_ЗадачиЗаданияВызовСервера.РасчитатьДлительностьФакт(СтруктураДат, ЗаданиеОбъект.ДлительностьФакт);
					
					МенеджерЗаписи.Записать(Истина);       
					
					Для каждого Исполнители Из ЗаданиеОбъект.СсылкаНаЗадачу.Команда Цикл
						ПоследнийСтатус = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(ЗаданиеОбъект.СсылкаНаЗадачу, Исполнители.Исполнитель);
						Если СтатусЗадачи <> ПоследнийСтатус Тогда
							МенеджерЗаписи = РегистрыСведений.ЦБР_СтатусыЗадач.СоздатьМенеджерЗаписи();
							МенеджерЗаписи.Период = ТекущаяДатаСеанса();
							МенеджерЗаписи.Задача = ЗаданиеОбъект.СсылкаНаЗадачу;
							МенеджерЗаписи.Пользователь = Исполнители.Исполнитель; 
							МенеджерЗаписи.СостояниеЗадачи = СтатусЗадачи;
							МенеджерЗаписи.Записать();
						КонецЕсли;
					КонецЦикла;
					
					ЗаданиеОбъект.ДатаОкончаниеФакт = ТекущаяДатаСеанса();
				КонецЕсли;
				
			КонецЕсли;
			
		   	ЗаданиеОбъект.Состояние = Перечисления.ЦБР_Состояние.ЗапросИнформации;  
			ЦБР_СтатусыОбъектовПолныеПрава.УстановитьСтатусЗадания(ЗаданиеОбъект.Ссылка, Перечисления.ЦБР_Состояние.ЗапросИнформации);  
			
		Иначе //Задача
			
			СтатусЗадачи = Перечисления.ЦБР_Состояние.ЗапросИнформации;
			Для каждого Исполнители Из ЗаданиеОбъект.Команда Цикл
				ПоследнийСтатус = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Задание, Исполнители.Исполнитель);
				Если СтатусЗадачи <> ПоследнийСтатус Тогда
					МенеджерЗаписи = РегистрыСведений.ЦБР_СтатусыЗадач.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДатаСеанса();
					МенеджерЗаписи.Задача = ЗаданиеОбъект.Ссылка;
					МенеджерЗаписи.Пользователь = Исполнители.Исполнитель; 
					МенеджерЗаписи.СостояниеЗадачи = СтатусЗадачи;
					МенеджерЗаписи.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
		Если ТипЗнч(ЗаданиеОбъект) = Тип("СправочникОбъект.ЦБР_Задача") Тогда
			ЗаданиеОбъект.Записать();
		Иначе
			ЗаданиеОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьНеобходимостьТранзакции()

	Если ТипЗнч(Задание) = Тип("ДокументСсылка.ЦБР_Задание") Тогда
		Если Задание.Состояние = Перечисления.ЦБР_Состояние.ВРаботе Или Задание.Состояние = Перечисления.ЦБР_Состояние.Согласован Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		СостояниеЗадачи = ЦБР_СтатусыОбъектовПолныеПрава.ПолучитьАктуальныйСтатусЗадачиПользователя(Задание, Пользователи.ТекущийПользователь());
		
		Если СостояниеЗадачи <> Перечисления.ЦБР_Состояние.ЗапросИнформации Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура СообщениеВОбсуждение()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	Получатели = Новый Массив;
	Получатели.Добавить(Ответчик);
	ЦБР_ОбсужденияСервер.УведомлениеВОбсуждение(Задание, "ЗапросИнформации", Получатели, ТекстЗапроса);	
		
КонецПроцедуры

#КонецОбласти
